In [1]:
import pandas as pd

In [22]:
# Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
# of the data types into a pandas series. Create a separate list of index values for the
# series.

l1=[i for i in range(1,11)]
s1=set([1,2,3,4,5,6,7,8,9,10])
t1=tuple([1,2,3,4,5,6,7,8,9,10])

df1=pd.Series(l1,index=[i for i in range(10,20)])
df2=pd.Series(list(s1),index=[i for i in range(10,20)])
df3=pd.Series(t1,index=[i for i in range(10,20)])

In [17]:
df1=pd.Series(l1,index=[i for i in range(10,20)])
df2=pd.Series(list(s1),index=[i for i in range(10,20)])
df3=pd.Series(t1,index=[i for i in range(10,20)],)

In [20]:
df2

     0
10   1
11   2
12   3
13   4
14   5
15   6
16   7
17   8
18   9
19  10

In [23]:
#  Create a python dictionary with three key value pairs. Keep the keys as the first names,
# and the respective last names as values in the dictionary. Use the dictionary to create a
# pandas series.

dic1={"Anirudh":"Santhosh","Rohit":"Sharma","MS":"Dhoni"}

pd.Series(dic1)

Anirudh    Santhosh
Rohit        Sharma
MS            Dhoni
dtype: object

In [36]:
# Create a pandas series, with the elements as numbers from 1-10. Use the index values
# starting from 0-10. For the above series:
# a. Convert it to a list.
# b. Convert it to a dictionary.
# c. Convert it to a tuple.
# d. Convert it to a set.

p1=pd.Series([1,2,3,4,5,6,7,8,9,10],index=[i for i in range(0,10)])
list(p1)
dict(p1)
tuple(p1)
set(p1)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [37]:
dict(p1)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [31]:
p1.to_dict()

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [33]:
tuple(p1)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [112]:
# 4. Create a sample pandas series with x integer elements. Perform the following operations
# on the same:
# a. Print the first 5 elements of the series
# b. Print the last 5 elements of the series
# c. Insert an integer value ‘50’ at the index 5.
# d. Update the last element in the series with the value 100.
# e. Delete the first element from the series.

s1=pd.Series([i for i in range(1,11)])

In [113]:
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [114]:
s1[0:5]
s1[-5:]
#to add a element in particular index in series we need to convert it to list then only
l2=list(s1)
l2.insert(5,50)
s1=pd.Series(l2)
# s1?
s1.iloc[2]
s1=s1.drop(0)

In [115]:
s1

1      2
2      3
3      4
4      5
5     50
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [119]:
s1.values

array([ 2,  3,  4,  5, 50,  6,  7,  8,  9, 10], dtype=int64)

In [121]:
# 5. For a given pandas series obtained in the 4th step. Write a sample code to find the
# element 100 in the series.

100 in s1.values

False

In [130]:
# 6. For the given series A and B, perform concatenation on the same.
# series_A = pd.Series([1,2,3,4,5])
# series_B = pd.Series([6,7,8,9,10])

series_a=pd.Series([1,2,3,4,5])
series_b=pd.Series([6,7,8,9,10])

series_c=pd.concat([series_a,series_b],ignore_index=True)

In [131]:
series_c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [132]:
# 7. Using loops in python, print all the elements within a pandas series.
# Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

for i in series_c:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [135]:
# 8. For a given nested list and a sample dictionary, create two data frames using pandas.
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

df1=pd.DataFrame(List)
df2=pd.DataFrame(Dictionary)

In [137]:
df1

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [139]:
df1=pd.DataFrame(List,columns=["col1","col2","col3"])

In [141]:
df1

  col1 col2 col3
0   AA   BB   CC
1   DD   EE   FF
2   GG   HH   II

In [140]:
df2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [174]:
# 9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
# operations on the same.
# a. Print the first 3 rows of the Data Frame .
# b. Print the rows that have the age greater than 15.
# c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
# d. Update the 5th row so that the name = john and age=56.
# e. Delete the first row from the Data Frame .


df3=pd.DataFrame({"Name":["Anirudh","Rohit","Raina","Dhoni","Rahul","Mohit"],"Age":[22,45,16,43,55,34]})

df3.head(3)
#adding by creeating a new dataframe and perdorming concatination
df2=pd.DataFrame({"Name":["Ani","Rohita","Rana","Kohli","Raman","Mohita"],"Age":[26,15,26,53,75,14]})
df3=pd.concat([df3,df2],axis=0,ignore_index=True)
df3[df3["Age"]>15]
df3.iloc[4]=["John",56]
df3.drop(0,inplace=True)

In [175]:
df3

      Name  Age
1    Rohit   45
2    Raina   16
3    Dhoni   43
4     John   56
5    Mohit   34
6      Ani   26
7   Rohita   15
8     Rana   26
9    Kohli   53
10   Raman   75
11  Mohita   14